Feature: Start searching
  Scenario: Тестовое задание
    Given Пользователь запускает браузер
    When Пользователь открывает сайт Тендора
      Then Пользователь нажимает кнопку поставщикам
      Then Пользователь нажимает кнопку Расширенный поиск
      Then Пользователь нажимает кнопку Настройка поиска
      Then Пользователь исключает совместные закупки
      Then Пользователь нажимает кнопку регион поставки
      Then Пользователь выбирает Алтайский край
      Then Пользователь нажимает кнопку Фильтры по датам
      Then Пользователь настраивает даты подачи заявок
      Then Пользователь указывает сегодняшнюю дату
      Then Пользователь октлючает активные закупки
      Then Пользователь нажимает кнопку Найти
      Then Сохранение данных в файл







